
package Multithreading_Concurrency_parallelism_synchronous_and_asynchronous;
/**
 * Concurrency - переводится как совпадение или согласованность(параллельный), означает выполнение сразу нескольких задач, но не обязательно в одно и тоже время, как достигается concurrency зависит от процессора компьютера
 * 
 */
public class Concurrency_and_parallelism {
    
}
/**
 * 1. Допустим нам дается задание петь и кушать(это concurrecy) мы выполняем эти действия в одно время но не одновременно, потому что нельзя кушать 
 * и петь одновременно(аналогия с одноядерным ПК)
 * 2. Готовить и говорить по телефону(это тоже concurrecy кторое достигается с помощью параллелизма ), параллелизи это частный случай concurrecy
 */