
package Multithreading_Concurrency_parallelism_synchronous_and_asynchronous;


public class Synchronous_and_Asynchronous {
    
}
/**
 * например нам нужно:
 * 1.Написать 2 письма, невозможно одновременно писать 2 письма мы сначала пишем первое письмо потом второе,в синхронном программировании все задачи выполняются последовательно,в программировании понятие синхронно - означает последовательно друг за другом
 * 
 * 2.Сделать бутерброд и постирать белье: мы можем бросить вещи в стиральную машину и не дожидаясь пока она закончит стирку пойти делать бутерброт, здесь
 * мы делаем эти 2 действия асинхронно, в асинхронном программировании, когда мы когда выполняетя какая-то задача, мы можем переключится на другую задачу
 * не дожидаясь окончания первой.Асинхронное программирование позволяет нам достичь concurrency, есть ПК имеет множество ядер, то остич параллельности
 */